<?php
 
 
// ПОТОМ УДАЛИТЬ!!! Здесь тестовый массив для проверки работы  - д.б.Массив из COOKIE со значениями
$value = [
    "int1" => 90,
    "int2" => 20,
    "int3" => 80,
    "int4" => 30,
    "int5" => 70,
    "int6" => 60,
    "int7" => 40,
    "int8" => 50,
    "int9" => 13,
    "int10" => 36,
    "int11" => 87,
    "int12" => 130,
    "int13" => 7,
    "int14" => 6,
    "int15" => 42,
    "int16" => 56,
    "int17" => 62,
    "int18" => 82,
    "int19" => 206,
    "int20" => 51
   
  ];
  //запись тестового массива в COOKIE ;
  setcookie('Interests', json_encode($value), time()+60*60*24*180 );


?>